// КаталогСправки задан как "C:\444". Разместите там каталог OneScriptFormsru с файлами справки или укажите свой.
// КаталогБиблиотеки задан как "C:\444\111\OneScriptForms\OneScriptForms\bin\Debug". Разместите там файл библиотеки OneScriptForms.dll или укажите свой.
// Продолжительность примерно 20 минут.
Перем Ф, ИмяВременногоФайла, Таймер, ПолеВвода1, Форма1, Сч1, Сч2, Сч3, Сч4, Сч5, Сч6;
Перем ТекстТеста, СтрКода0, СтрСозданияОбъекта, СтрСозданияОбъекта2, СписокИменПараметров, ФормаNotifyIcon;
Перем СписокОшибок, КаталогСправки, КаталогБиблиотеки;

Функция РазобратьСтроку(Строка, Разделитель)
	Стр = СтрЗаменить(Строка, Разделитель, Символы.ПС);
	М = Новый Массив;
	Если ПустаяСтрока(Стр) Тогда
		Возврат М;
	КонецЕсли;
	Для Ч = 1 По СтрЧислоСтрок(Стр) Цикл
		М.Добавить(СтрПолучитьСтроку(Стр,Ч));
	КонецЦикла;
	Возврат М;
КонецФункции

Функция СтрНайтиМежду(СтрПараметр, Фрагмент1 = Неопределено, Фрагмент2 = Неопределено, ИсключитьФрагменты = Истина, БезНаложения = Истина)
	//Стр - исходная строка
	//Фрагмент1 - подстрока поиска от которой ведем поиск
	//Фрагмент2 - подстрока поиска до которой ведем поиск
	//ИсключитьФрагменты - не включать Фрагмент1 и Фрагмент2 в результат
	//БезНаложения - в результат не будут включены участки, содержащие дугие найденные участки, удовлетворяющие переданным параметрам
	//функция возвращает массив строк
	Стр = СтрПараметр;
	М = Новый Массив;
	Если (Фрагмент1 <> Неопределено) и (Фрагмент2 = Неопределено) Тогда
		Позиция = Найти(Стр, Фрагмент1);
		Пока Позиция > 0 Цикл
			М.Добавить(?(ИсключитьФрагменты, Сред(Стр, Позиция + СтрДлина(Фрагмент1)), Сред(Стр, Позиция)));
			Стр = Сред(Стр, Позиция + 1);
			Позиция = Найти(Стр, Фрагмент1);
		КонецЦикла;
	ИначеЕсли (Фрагмент1 = Неопределено) и (Фрагмент2 <> Неопределено) Тогда
		Позиция = Найти(Стр, Фрагмент2);
		СуммаПозиций = Позиция;
		Пока Позиция > 0 Цикл
			М.Добавить(?(ИсключитьФрагменты, Сред(Стр, 1, СуммаПозиций - 1), Сред(Стр, 1, СуммаПозиций - 1 + СтрДлина(Фрагмент2))));
			Позиция = Найти(Сред(Стр, СуммаПозиций + 1), Фрагмент2);
			СуммаПозиций = СуммаПозиций + Позиция;
		КонецЦикла;
	ИначеЕсли (Фрагмент1 <> Неопределено) и (Фрагмент2 <> Неопределено) Тогда
		Позиция = Найти(Стр, Фрагмент1);
		Пока Позиция > 0 Цикл
			Стр2 = ?(ИсключитьФрагменты, Сред(Стр, Позиция + СтрДлина(Фрагмент1)), Сред(Стр, Позиция));
			Позиция2 = Найти(Стр2, Фрагмент2);
			СуммаПозиций2 = Позиция2;
			Пока Позиция2 > 0 Цикл
				Если БезНаложения Тогда
					Если Найти(Сред(Стр2, 1, СуммаПозиций2 - 1), Фрагмент2) = 0 Тогда
						М.Добавить("" + ?(ИсключитьФрагменты, Сред(Стр2, 1, СуммаПозиций2 - 1), Сред(Стр2, 1, СуммаПозиций2 - 1 + СтрДлина(Фрагмент2))));
					КонецЕсли;
				Иначе
					М.Добавить("" + ?(ИсключитьФрагменты, Сред(Стр2, 1, СуммаПозиций2 - 1), Сред(Стр2, 1, СуммаПозиций2 - 1 + СтрДлина(Фрагмент2))));
				КонецЕсли;
				Позиция2 = Найти(Сред(Стр2, СуммаПозиций2 + 1), Фрагмент2);
				СуммаПозиций2 = СуммаПозиций2 + Позиция2;
			КонецЦикла;
			Стр = Сред(Стр, Позиция + 1);
			Позиция = Найти(Стр, Фрагмент1);
		КонецЦикла;
	КонецЕсли;
	
	Возврат М;
КонецФункции

Процедура ТестированиеКодов()
	ВыбранныеФайлы = НайтиФайлы(КаталогСправки + "\OSClientServerRu", "*.html", Истина);
	Для А = 0 По ВыбранныеФайлы.ВГраница() Цикл
		Сообщить(" (" + Ф.Математика().Окр(((ТекущаяУниверсальнаяДатаВМиллисекундах() - Таймер)/1000)/60, 2) + " мин." + " " + А + " из " + ВыбранныеФайлы.ВГраница() + ") " + 
			ВыбранныеФайлы[А].ПолноеИмя);
		Если (ВыбранныеФайлы[А].ПолноеИмя = КаталогСправки + "\OneScriptFormsru\SaveFileDialog.Reset.html") Тогда
			Продолжить;
		КонецЕсли;
		
		// // // Если ВыбранныеФайлы[А].Имя = "OneScriptForms.DataGridViewButtonColumn.DefaultCellStyle.html" Тогда 
		// // // ИначеЕсли ВыбранныеФайлы[А].Имя = "OneScriptForms.DataGridViewCell.Style.html" Тогда  
		// // // ИначеЕсли ВыбранныеФайлы[А].Имя = "OneScriptForms.DataGridViewColumn.DefaultCellStyle.html" Тогда 
		// // // ИначеЕсли ВыбранныеФайлы[А].Имя = "OneScriptForms.DataGridViewImageColumn.DefaultCellStyle.html" Тогда 
		// // // Иначе
			// // // Продолжить;
		// // // КонецЕсли;

		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ВыбранныеФайлы[А].ПолноеИмя);
		Стр = ТекстДок.ПолучитьТекст();
		М = СтрНайтиМежду(Стр, "<details><summary>Тестовый код</summary>", "</PRE>", Ложь, );
		Если М.Количество() > 0 Тогда
			Для А2 = 0 По М.Количество() - 1 Цикл
				ТестовыйКод0 = СтрНайтиМежду(М[А2], "<DIV id=""cont", "</DIV>", Ложь, )[0];
				ТестовыйКод = СтрНайтиМежду(ТестовыйКод0, """>", "</DIV>", , )[0];
				Если Не (СокрЛП(ТестовыйКод) = "") Тогда
					ТекстДокХХХ = Новый ТекстовыйДокумент;
					
					// // // ИмяВременногоФайла = "C:\Users\master\AppData\Local\Temp\" + СтрЗаменить(ВыбранныеФайлы[А].Имя, ".html", "") + "-код.tmp";
					// // // ТекстДокХХХ.Записать(ИмяВременногоФайла);
					
					ТекстДокХХХ.Прочитать(ИмяВременногоФайла);
					ТекстДокХХХ.УстановитьТекст(ТестовыйКод);
					ТекстДокХХХ.Записать(ИмяВременногоФайла);
					Команда1("""C:\Program Files\OneScript\bin\oscript.exe""", ИмяВременногоФайла, ПолеВвода1, ВыбранныеФайлы[А].Имя);
					Форма1.Фокус();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры//ТестированиеКодов

Функция Команда1(ИмяФайла, Аргументы, Объект, ИмяФайлаСправки)
	ИнформацияЗапускаПроцесса1 = Ф.ИнформацияЗапускаПроцесса();
	ИнформацияЗапускаПроцесса1.ИмяФайла = ИмяФайла;
	ИнформацияЗапускаПроцесса1.Аргументы = Аргументы;
	ИнформацияЗапускаПроцесса1.СоздатьБезОкна = Истина;
	ИнформацияЗапускаПроцесса1.ИспользоватьОболочку = Ложь;
	ИнформацияЗапускаПроцесса1.СтильОкна = Ф.СтильОкнаПроцесса.Скрытое;
	ИнформацияЗапускаПроцесса1.ПеренаправитьСтандартныйВывод = Истина;

	Процесс1 = Ф.Процесс();
	Процесс1.НачальнаяИнформация = ИнформацияЗапускаПроцесса1;
	Процесс1.Начать();
	Если Не Процесс1.Завершен Тогда
		Стр1 = Процесс1.СтандартныйВывод.ПрочитатьСтроку();
		Пока Стр1 <> Неопределено Цикл
			Стр3 = "" + Стр1;
			Двоеточие = Прав(Стр3, 3);
			Двоеточие = Лев(Двоеточие, 1);
			Если (СтрНайти(Стр3, "!!!") > 0) или (СтрНайти(Стр3, "{") > 0)  или (Двоеточие <> ":") Тогда
				СписокОшибок.Добавить(Стр3 + "  " + ИмяФайлаСправки);
			КонецЕсли;
			Объект.ДобавитьТекст(Стр3 + "  " + ИмяФайлаСправки + Символы.ПС);
			Стр1 = Процесс1.СтандартныйВывод.ПрочитатьСтроку();
		КонецЦикла;
	Иначе
		Объект.ДобавитьТекст("Процесс1 завершен");
	КонецЕсли;
	Ф.ПередатьУправление();
КонецФункции

Таймер = ТекущаяУниверсальнаяДатаВМиллисекундах();

КаталогСправки = "C:\444";// без слэша
КаталогБиблиотеки = "C:\444\111\OneScriptClientServer\OneScriptClientServer\bin\Debug";// без слэша
ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
ТекстДокХХХ = Новый ТекстовыйДокумент;
ТекстДокХХХ.Записать(ИмяВременногоФайла);

ПодключитьВнешнююКомпоненту("C:\444\111\OneScriptForms\OneScriptForms\bin\Debug\OneScriptForms.dll");
Ф = Новый ФормыДляОдноСкрипта();
Форма1 = Ф.Форма();
Форма1.Текст = "Общий тест OneScriptClientServer.dll";
Форма1.Ширина = 1100;
Форма1.Высота = 600;
Форма1.Отображать = Истина;
Форма1.Показать();

ПолеВвода1 = Форма1.ЭлементыУправления.Добавить(Ф.ПолеВвода());
ПолеВвода1.МногострочныйРежим = Истина;
ПолеВвода1.Стыковка = Ф.СтильСтыковки.Заполнение;
ПолеВвода1.ЦветФона = Ф.Цвет().Черный;
ПолеВвода1.ОсновнойЦвет = Ф.Цвет().БледноЗеленый;
ПолеВвода1.ПолосыПрокрутки = Ф.ПолосыПрокрутки.Обе;
ПолеВвода1.ПринятиеВозврат = Истина;
ПолеВвода1.Перенос = Ложь;
ПолеВвода1.РегистрСимволов = Ф.РегистрСимволов.Стандартный;

СписокОшибок = Новый СписокЗначений;

ТестированиеКодов();

ПолеВвода1.ДобавитьТекст("==============================================================================================" + Символы.ПС);
ПолеВвода1.ДобавитьТекст("Тест выполнен за: " + ((ТекущаяУниверсальнаяДатаВМиллисекундах()-Таймер)/1000)/60 + " мин." + " " + ТекущаяДата() + Символы.ПС);
ПолеВвода1.ДобавитьТекст("Ошибок = " + СписокОшибок.Количество() + Символы.ПС);
Для А = 0 По СписокОшибок.Количество() - 1 Цикл
	ПолеВвода1.ДобавитьТекст("" + СписокОшибок.Получить(А).Значение + Символы.ПС);
КонецЦикла;

УдалитьФайлы(ИмяВременногоФайла);

Ф.ЗапуститьОбработкуСобытий();